-- Вставка данных в таблицу Коммивояжеров
INSERT INTO commissioners (full_name, address, phone) VALUES
('Иванов Иван Иванович', 'Москва, ул. Ленина, д. 1', '1234567890'),
('Петров Петр Петрович', 'Москва, ул. Маяковского, д. 3', '2345678901'),
('Сидоров Сидор Сидорович', 'Питер, ул. Невского, д. 5', '3456789012'),
('Кузнецова Мария Петровна', 'Москва, ул. Арбат, д. 2', '4567890123'),
('Алексеев Алексей Васильевич', 'Москва, ул. Тверская, д. 10', '5678901234'),
('Васильева Татьяна Ивановна', 'Питер, ул. Гоголя, д. 7', '6789012345'),
('Михайлов Михаил Сергеевич', 'Екатеринбург, ул. Чкалова, д. 8', '7890123456'),
('Григорьев Григорий Сергеевич', 'Новосибирск, ул. Кошевого, д. 4', '8901234567');

-- Вставка данных в таблицу Товаров
INSERT INTO products (name, price, unit) VALUES
('Батарейка', 100.00, 'шт'),
('Арбуз', 150.50, 'кг'),
('Ксяоми часы', 200.75, 'шт'),
('Свинина', 300.00, 'кг'),
('Блокнот', 50.20, 'шт'),
('Кукуруза', 75.90, 'кг'),
('Трусы', 120.00, 'шт'),
('Бананы', 180.00, 'кг');

-- Вставка данных в таблицу Командировок
INSERT INTO business_trips (commissioner_id, start_date, end_date) VALUES
(1, '2023-01-01', '2023-02-01'),
(1, '2024-01-01', '2024-02-01'),
(2, '2024-02-01', '2024-03-01'),
(3, '2024-03-01', '2024-04-01'),
(4, '2024-04-01', '2024-05-01'),
(5, '2024-05-01', '2024-06-01'),
(6, '2024-06-01', '2024-07-01'),
(7, '2024-07-01', '2024-08-01'),
(8, '2024-08-01', '2024-09-01');

-- Вставка данных в таблицу Товары в командировке
INSERT INTO products_in_trip (trip_id, product_id, quantity_taken) VALUES
(1, 1, 10.00),
(1, 2, 5.50),
(2, 3, 20.00),
(2, 4, 10.00),
(3, 5, 15.00),
(3, 6, 7.00),
(4, 7, 8.00),
(4, 8, 4.00),
(5, 7, 10.00),
(5, 8, 10.00);

-- Вставка данных в таблицу Возврат товаров
INSERT INTO products_returned (trip_id, product_id, quantity_returned) VALUES
(1, 1, 2.00),
(1, 2, 1.00),
(2, 3, 5.00),
(2, 4, 2.00),
(3, 5, 3.00),
(3, 6, 1.00),
(4, 7, 1.00),
(4, 8, 0.00),
(5, 7, 10.00),
(5, 8, 10.00);
